> Should be `images:ubuntu/24.04`

Same result

## full log
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # incus_instance.main will be created
  + resource "incus_instance" "main" {
      + config       = {
          + "boot.autostart" = "true"
        }
      + ephemeral    = false
      + image        = "ubuntu/24.04"
      + ipv4_address = (known after apply)
      + ipv6_address = (known after apply)
      + mac_address  = (known after apply)
      + name         = "terraform-instance"
      + profiles     = [
          + "default",
        ]
      + project      = "database"
      + remote       = "lxd-3"
      + running      = true
      + status       = (known after apply)
      + target       = (known after apply)
      + type         = "container"

      + device {
          + name       = "root"
          + properties = {
              + "path" = "/"
              + "pool" = "default"
              + "size" = "140GB"
            }
          + type       = "disk"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + main_instance_ipv4_addresses = (known after apply)
  + main_instance_ipv6_addresses = (known after apply)
  + main_instance_status         = (known after apply)
2025-04-06T18:07:17.150-0400 [INFO]  backend/local: apply calling Apply
2025-04-06T18:07:17.150-0400 [DEBUG] Building and walking apply graph for NormalMode plan
2025-04-06T18:07:17.151-0400 [DEBUG] Resource state not found for node "incus_instance.main", instance incus_instance.main
2025-04-06T18:07:17.151-0400 [DEBUG] ProviderTransformer: "incus_instance.main" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/lxc/incus"]
2025-04-06T18:07:17.151-0400 [DEBUG] ProviderTransformer: "incus_instance.main (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/lxc/incus"]
2025-04-06T18:07:17.151-0400 [DEBUG] ReferenceTransformer: "var.incus_remote" references: []
2025-04-06T18:07:17.151-0400 [DEBUG] ReferenceTransformer: "output.main_instance_name (expand)" references: [incus_instance.main incus_instance.main incus_instance.main (expand)]
2025-04-06T18:07:17.151-0400 [DEBUG] ReferenceTransformer: "output.main_instance_ipv4_addresses (expand)" references: [incus_instance.main incus_instance.main incus_instance.main (expand)]
2025-04-06T18:07:17.151-0400 [DEBUG] ReferenceTransformer: "incus_instance.main" references: [var.incus_remote var.incus_project var.instance_image var.instance_name]
2025-04-06T18:07:17.151-0400 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/lxc/incus\"]" references: []
2025-04-06T18:07:17.151-0400 [DEBUG] ReferenceTransformer: "incus_instance.main (expand)" references: []
2025-04-06T18:07:17.151-0400 [DEBUG] ReferenceTransformer: "var.instance_name" references: []
2025-04-06T18:07:17.151-0400 [DEBUG] ReferenceTransformer: "var.instance_image" references: []
2025-04-06T18:07:17.151-0400 [DEBUG] ReferenceTransformer: "var.instance_profiles" references: []
2025-04-06T18:07:17.151-0400 [DEBUG] ReferenceTransformer: "var.incus_project" references: []
2025-04-06T18:07:17.151-0400 [DEBUG] ReferenceTransformer: "var.existing_network" references: []
2025-04-06T18:07:17.151-0400 [DEBUG] ReferenceTransformer: "output.main_instance_status (expand)" references: [incus_instance.main incus_instance.main incus_instance.main (expand)]
2025-04-06T18:07:17.151-0400 [DEBUG] ReferenceTransformer: "output.main_instance_ipv6_addresses (expand)" references: [incus_instance.main incus_instance.main incus_instance.main (expand)]
2025-04-06T18:07:17.151-0400 [DEBUG] Starting graph walk: walkApply
2025-04-06T18:07:17.151-0400 [DEBUG] created provider logger: level=debug
2025-04-06T18:07:17.151-0400 [INFO]  provider: configuring client automatic mTLS
2025-04-06T18:07:17.153-0400 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/lxc/incus/0.3.1/darwin_arm64/terraform-provider-incus_v0.3.1 args=[.terraform/providers/registry.terraform.io/lxc/incus/0.3.1/darwin_arm64/terraform-provider-incus_v0.3.1]
2025-04-06T18:07:17.155-0400 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/lxc/incus/0.3.1/darwin_arm64/terraform-provider-incus_v0.3.1 pid=64935
2025-04-06T18:07:17.155-0400 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/lxc/incus/0.3.1/darwin_arm64/terraform-provider-incus_v0.3.1
2025-04-06T18:07:17.161-0400 [INFO]  provider.terraform-provider-incus_v0.3.1: configuring server automatic mTLS: timestamp=2025-04-06T18:07:17.161-0400
2025-04-06T18:07:17.166-0400 [DEBUG] provider.terraform-provider-incus_v0.3.1: plugin address: address=/var/folders/cq/lk9gsbvn21dbmq5ygzr94tsr0000gn/T/plugin937677974 network=unix timestamp=2025-04-06T18:07:17.166-0400
2025-04-06T18:07:17.166-0400 [DEBUG] provider: using plugin: version=6
2025-04-06T18:07:17.172-0400 [DEBUG] No provider meta schema returned
2025-04-06T18:07:17.173-0400 [DEBUG] provider.terraform-provider-incus_v0.3.1: 2025/04/06 18:07:17 [DEBUG] Incus Config: &cliconfig.Config{DefaultRemote:"lxd-3", Remotes:map[string]cliconfig.Remote{"images":cliconfig.Remote{Addr:"https://images.linuxcontainers.org", AuthType:"", KeepAlive:0, Project:"", Protocol:"simplestreams", Public:true, Global:false, Static:false}, "local":cliconfig.Remote{Addr:"unix://", AuthType:"", KeepAlive:0, Project:"", Protocol:"incus", Public:false, Global:false, Static:true}, "lxd-3":cliconfig.Remote{Addr:"https://10.0.0.237:8443", AuthType:"tls", KeepAlive:0, Project:"default", Protocol:"incus", Public:false, Global:false, Static:false}, "theminer":cliconfig.Remote{Addr:"https://10.0.0.167:8443", AuthType:"tls", KeepAlive:0, Project:"default", Protocol:"incus", Public:false, Global:false, Static:false}}, Aliases:map[string]string{}, ConfigDir:"/Users/snoby/.config/incus", CacheDir:"", UserAgent:"", PromptPassword:(func(string) (string, error))(nil), ProjectOverride:"", oidcTokens:map[string]*oidc.Tokens[*github.com/zitadel/oidc/v3/pkg/oidc.IDTokenClaims](nil)}
2025-04-06T18:07:17.173-0400 [DEBUG] provider.terraform-provider-incus_v0.3.1: 2025/04/06 18:07:17 [DEBUG] Incus Provider: (**config.IncusProviderConfig)(0x140003a8138)
2025-04-06T18:07:17.174-0400 [DEBUG] skipping FixUpBlockAttrs
2025-04-06T18:07:17.177-0400 [DEBUG] provider.terraform-provider-incus_v0.3.1: Marking Computed attributes with null configuration values as unknown (known after apply) in the plan to prevent potential Terraform errors: tf_rpc=PlanResourceChange tf_provider_addr=registry.terraform.io/lxc/incus tf_req_id=6c80f380-f266-fa49-4513-eadfb52ebc99 tf_resource_type=incus_instance @caller=github.com/hashicorp/terraform-plugin-framework@v1.14.1/internal/fwserver/server_planresourcechange.go:229 @module=sdk.framework timestamp=2025-04-06T18:07:17.177-0400
2025-04-06T18:07:17.177-0400 [DEBUG] provider.terraform-provider-incus_v0.3.1: marking computed attribute that is null in the config as unknown: @caller=github.com/hashicorp/terraform-plugin-framework@v1.14.1/internal/fwserver/server_planresourcechange.go:480 @module=sdk.framework tf_attribute_path=AttributeName("profiles") tf_req_id=6c80f380-f266-fa49-4513-eadfb52ebc99 tf_resource_type=incus_instance tf_rpc=PlanResourceChange tf_provider_addr=registry.terraform.io/lxc/incus timestamp=2025-04-06T18:07:17.177-0400
2025-04-06T18:07:17.177-0400 [DEBUG] provider.terraform-provider-incus_v0.3.1: marking computed attribute that is null in the config as unknown: tf_req_id=6c80f380-f266-fa49-4513-eadfb52ebc99 tf_rpc=PlanResourceChange tf_provider_addr=registry.terraform.io/lxc/incus @module=sdk.framework tf_attribute_path=AttributeName("ipv4_address") tf_resource_type=incus_instance @caller=github.com/hashicorp/terraform-plugin-framework@v1.14.1/internal/fwserver/server_planresourcechange.go:480 timestamp=2025-04-06T18:07:17.177-0400
2025-04-06T18:07:17.177-0400 [DEBUG] provider.terraform-provider-incus_v0.3.1: marking computed attribute that is null in the config as unknown: @module=sdk.framework tf_attribute_path=AttributeName("ipv6_address") tf_req_id=6c80f380-f266-fa49-4513-eadfb52ebc99 tf_resource_type=incus_instance @caller=github.com/hashicorp/terraform-plugin-framework@v1.14.1/internal/fwserver/server_planresourcechange.go:480 tf_provider_addr=registry.terraform.io/lxc/incus tf_rpc=PlanResourceChange timestamp=2025-04-06T18:07:17.177-0400
2025-04-06T18:07:17.177-0400 [DEBUG] provider.terraform-provider-incus_v0.3.1: marking computed attribute that is null in the config as unknown: tf_provider_addr=registry.terraform.io/lxc/incus tf_rpc=PlanResourceChange @caller=github.com/hashicorp/terraform-plugin-framework@v1.14.1/internal/fwserver/server_planresourcechange.go:480 @module=sdk.framework tf_attribute_path=AttributeName("status") tf_req_id=6c80f380-f266-fa49-4513-eadfb52ebc99 tf_resource_type=incus_instance timestamp=2025-04-06T18:07:17.177-0400
2025-04-06T18:07:17.177-0400 [DEBUG] provider.terraform-provider-incus_v0.3.1: marking computed attribute that is null in the config as unknown: @caller=github.com/hashicorp/terraform-plugin-framework@v1.14.1/internal/fwserver/server_planresourcechange.go:480 @module=sdk.framework tf_provider_addr=registry.terraform.io/lxc/incus tf_req_id=6c80f380-f266-fa49-4513-eadfb52ebc99 tf_resource_type=incus_instance tf_attribute_path=AttributeName("mac_address") tf_rpc=PlanResourceChange timestamp=2025-04-06T18:07:17.177-0400
2025-04-06T18:07:17.177-0400 [DEBUG] provider.terraform-provider-incus_v0.3.1: marking computed attribute that is null in the config as unknown: @module=sdk.framework tf_attribute_path=AttributeName("target") tf_provider_addr=registry.terraform.io/lxc/incus tf_rpc=PlanResourceChange @caller=github.com/hashicorp/terraform-plugin-framework@v1.14.1/internal/fwserver/server_planresourcechange.go:480 tf_req_id=6c80f380-f266-fa49-4513-eadfb52ebc99 tf_resource_type=incus_instance timestamp=2025-04-06T18:07:17.177-0400
incus_instance.main: Creating...
2025-04-06T18:07:17.179-0400 [INFO]  Starting apply for incus_instance.main
2025-04-06T18:07:17.179-0400 [DEBUG] skipping FixUpBlockAttrs
2025-04-06T18:07:17.179-0400 [DEBUG] incus_instance.main: applying the planned Create change
2025-04-06T18:07:17.259-0400 [ERROR] provider.terraform-provider-incus_v0.3.1: Response contains error diagnostic: tf_proto_version=6.8 tf_provider_addr=registry.terraform.io/lxc/incus @caller=github.com/hashicorp/terraform-plugin-go@v0.26.0/tfprotov6/internal/diag/diagnostics.go:58 diagnostic_detail="Image not found" diagnostic_severity=ERROR tf_resource_type=incus_instance @module=sdk.proto diagnostic_summary="Failed to retrieve image info for instance "terraform-instance"" tf_req_id=acfa5391-1c2f-7700-d539-7871ba2297ba tf_rpc=ApplyResourceChange timestamp=2025-04-06T18:07:17.259-0400
2025-04-06T18:07:17.265-0400 [DEBUG] State storage *statemgr.Filesystem declined to persist a state snapshot
2025-04-06T18:07:17.265-0400 [ERROR] vertex "incus_instance.main" error: Failed to retrieve image info for instance "terraform-instance"
╷
│ Error: Failed to retrieve image info for instance "terraform-instance"
│
│   with incus_instance.main,
│   on instances.tf line 1, in resource "incus_instance" "main":
│    1: resource "incus_instance" "main" {
│
│ Image not found
╵
```

I'll go copy your image from your example and try again